#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = СоздатьАктыНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = "Формирование актов ...";
	
	Оповещение = Новый ОписаниеОповещения(ОперацияВФонеЗавершения, ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьАктыНаСервере()
	
	ИмяФункции = "Обработки.ВКМ_МассовоеСозданиеАктов.СозданныеАкты";
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("Период", Объект.Период);
	
	ПарамертыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПарамертыВыполнения.НаименованиеФоновогоЗадания = ИмяФункции;
	ПарамертыВыполнения.ЗапуститьВФоне = Истина;
	ПарамертыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяФункции, ПараметрыФункции);

КонецФункции

&НаКлиенте
Процедура ОперацияВФонеЗавершения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ДлительныеОперацииЗавершениеНаСервере(Результат.АдресРезультата);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Формирование документов реализации выполнено успешно");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Статус операции: Ошибка выполнения, обратитесь к системному администратору");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДлительныеОперацииЗавершениеНаСервере(АдресХранилища)
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	СсылкаНаДокумент = Результат;
	
	Объект.СписокДоговоров.Очистить();
	
	Для Каждого Строка Из СсылкаНаДокумент Цикл
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.Договор = Строка.Договор;
		НоваяСтрока.Ссылка = Строка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли