#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СформироватьДвижения();
	РассчитатьДополнительныеНачисления();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
		
	Для Каждого Строка Из Начисления Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = Строка.ВидРасчета;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Подразделение = Строка.Подразделение;
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = Строка.Удержание;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Подразделение = Строка.Подразделение;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

Процедура РассчитатьДополнительныеНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение,
	|	ВКМ_ОсновныеНачисления.Результат КАК Начислено
	|ПОМЕСТИТЬ ВТ_ДанныеОНачислении
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ОсновныеНачисления.Сотрудник
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|	И ВКМ_ДополнительныеНачисления.ВидРасчета = &ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОНачислении.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник, 0) КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
	|	ВТ_ДанныеОНачислении.Начислено КАК Начислено,
	|	ВТ_ДанныеОНачислении.Подразделение КАК Подразделение,
	|	ВКМ_ФиксированнаяПремия.Значение КАК Премия
	|ИЗ
	|	ВТ_ДанныеОНачислении КАК ВТ_ДанныеОНачислении
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&МоментВремени,) КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеОНачислении.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
	|	Константа.ВКМ_ФиксированнаяПремия КАК ВКМ_ФиксированнаяПремия";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПроцентОтРабот) Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления[Выборка.НомерСтроки - 1];
			Премия = Выборка.Начислено * Выборка.ПроцентОтРабот / 100;
			Движение.Результат = Премия;
			Движение.Размер = Выборка.ПроцентОтРабот;
				
			Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
			Удержано = Премия * 13 / 100;
			Движение.Результат = Удержано;
		
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками[Выборка.НомерСтроки - 1];
			Движение.Сумма = Премия - Удержано;
		Иначе
			Движение = Движения.ВКМ_ДополнительныеНачисления[Выборка.НомерСтроки - 1];
			Премия = Выборка.Премия;
			Движение.Результат = Премия;
				
			Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
			Удержано = Премия * 13 / 100;
			Движение.Результат = Удержано;
		
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками[Выборка.НомерСтроки - 1];
			Движение.Сумма = Премия - Удержано;
		КонецЕсли;
	КонецЦикла;
		
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли