
#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ОтправкаУведомленийТелеграмБоту() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК Текст,
	|	ВКМ_ИдентификаторГруппыДляОповещения.Значение КАК Chat_id,
	|	ВКМ_ТокенУправленияТелеграмБотом.Значение КАК TokenTG
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту,
	|	Константа.ВКМ_ТокенУправленияТелеграмБотом КАК ВКМ_ТокенУправленияТелеграмБотом,
	|	Константа.ВКМ_ИдентификаторГруппыДляОповещения КАК ВКМ_ИдентификаторГруппыДляОповещения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		TokenTG = Выборка.TokenTG;
		Chat_id = Выборка.Chat_id;
		ТекстСообщения = Выборка.Текст;
		
		АдресТГ = "api.telegram.org";
		Соединение = Новый HTTPСоединение(АдресТГ, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
		
		Данные = Новый Структура;
		Данные.Вставить("text", ТекстСообщения);
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("content-type", "application/json");
		АдресЗапроса = "bot" + TokenTG + "/sendMessage?chat_id=" + Формат(Chat_id, "ЧГ=");
		Запрос = Новый HTTPЗапрос(АдресЗапроса, Заголовки);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Попытка
			Результат = Соединение.ОтправитьДляОбработки(Запрос);
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Если Не Результат.КодСостояния = 200 Тогда
			ВызватьИсключение "Ошибка проверки связи";
		КонецЕсли;
		
		Возврат
		
	КонецЦикла;
КонецПроцедуры


#КонецОбласти