
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если Объект.Ссылка = Документы.ВКМ_НачислениеЗаработнойПлаты.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Документ не записан. Запишите документ и повторите попытку.");
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьАвтозаполнение();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
		
КонецПроцедуры

#КонецОбласти
